Ran Plan for project: `homelab-k8s-cluster-room101-a7d-mc` dir: `cluster` workspace: `default`

<details><summary>Show Output</summary>

```diff
data.vault_generic_secret.terraform_generic: Reading...
data.vault_generic_secret.terraform_pve_auth: Reading...
data.vault_generic_secret.terraform_pve_token: Reading...
data.vault_generic_secret.terraform_pve_auth: Read complete after 0s [id=proxmox/terraform-pve-auth]
data.vault_generic_secret.terraform_pve_token: Read complete after 0s [id=proxmox/terraform-pve-token]
data.vault_generic_secret.terraform_generic: Read complete after 0s [id=proxmox/terraform-pve-config]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # macaddress.master_net0_mac[0] will be created
+ resource "macaddress" "master_net0_mac" {
      + address = (known after apply)
      + id      = (known after apply)
    }

  # null_resource.master_smbios1_values[0] will be created
+ resource "null_resource" "master_smbios1_values" {
      + id = (known after apply)
    }

  # null_resource.master_start[0] will be created
+ resource "null_resource" "master_start" {
      + id = (known after apply)
    }

  # null_resource.master_stop[0] will be created
+ resource "null_resource" "master_stop" {
      + id = (known after apply)
    }

  # random_string.master_serial[0] will be created
+ resource "random_string" "master_serial" {
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # random_uuid.master_uuid[0] will be created
+ resource "random_uuid" "master_uuid" {
      + id     = (known after apply)
      + result = (known after apply)
    }

  # time_sleep.master_sleep_10s[0] will be created
+ resource "time_sleep" "master_sleep_10s" {
      + create_duration = "10s"
      + id              = (known after apply)
    }

  # time_sleep.worker_sleep_10s[0] will be created
+ resource "time_sleep" "worker_sleep_10s" {
      + create_duration = "10s"
      + id              = (known after apply)
    }

  # module.master_instances[0].proxmox_vm_qemu.proxmox_instance will be created
+ resource "proxmox_vm_qemu" "proxmox_instance" {
      + additional_wait           = 5
      + agent                     = 0
      + automatic_reboot          = true
      + balloon                   = 0
      + bios                      = "seabios"
      + boot                      = "order=scsi0;net0"
      + bootdisk                  = (known after apply)
      + clone_wait                = 10
      + cores                     = 2
      + cpu                       = "host"
      + default_ipv4_address      = (known after apply)
      + define_connection_info    = true
      + desc                      = (known after apply)
      + force_create              = false
      + full_clone                = true
      + guest_agent_ready_timeout = 100
      + hagroup                   = "ha-group-1"
      + hastate                   = "enabled"
      + hotplug                   = "network,disk,usb"
      + id                        = (known after apply)
      + kvm                       = true
      + memory                    = 3072
      + name                      = "master0-room101-a7d-mc"
      + nameserver                = (known after apply)
      + onboot                    = false
      + oncreate                  = false
      + pool                      = "room101-a7d-mc"
      + preprovision              = true
      + pxe                       = true
      + reboot_required           = (known after apply)
      + scsihw                    = "lsi"
      + searchdomain              = (known after apply)
      + sockets                   = 1
      + ssh_host                  = (known after apply)
      + ssh_port                  = (known after apply)
      + tablet                    = true
      + target_node               = "host-01"
      + unused_disk               = (known after apply)
      + vcpus                     = 0
      + vlan                      = -1
      + vmid                      = 410

      + disk {
          + backup             = true
          + cache              = "none"
          + file               = (known after apply)
          + format             = (known after apply)
          + iops               = 0
          + iops_max           = 0
          + iops_max_length    = 0
          + iops_rd            = 0
          + iops_rd_max        = 0
          + iops_rd_max_length = 0
          + iops_wr            = 0
          + iops_wr_max        = 0
          + iops_wr_max_length = 0
          + iothread           = 0
          + mbps               = 0
          + mbps_rd            = 0
          + mbps_rd_max        = 0
          + mbps_wr            = 0
          + mbps_wr_max        = 0
          + media              = (known after apply)
          + replicate          = 0
          + size               = "30G"
          + slot               = (known after apply)
          + ssd                = 0
          + storage            = "local-lvm"
          + storage_type       = (known after apply)
          + type               = "scsi"
          + volume             = (known after apply)
        }

      + network {
          + bridge    = "vmbr0"
          + firewall  = false
          + link_down = false
          + macaddr   = (known after apply)
          + model     = "virtio"
          + queues    = (known after apply)
          + rate      = (known after apply)
          + tag       = 1100
        }
    }

Plan: 9 to add, 0 to change, 0 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p homelab-k8s-cluster-room101-a7d-mc`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.lab.analbeard.com/lock?id=a7d-corp%252Fhomelab-k8s-cluster-room101-a7d-mc%252Fcluster%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p homelab-k8s-cluster-room101-a7d-mc`
</details>
Plan: 9 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`